Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་ལས་ནི་མི་ལྡོག་ཅིང་།
en: Their progress to awakening will therefore not be reversed,

source: །ཤེས་རབ་དག་ནི་འཕེལ་བར་འགྱུར།
en: And their insight will increase.

source: །མ་ཐོས་ཆོས་ནི་ཐོས་གྱུར་ན།
en: “When they hear a Dharma teaching they have not heard before,

source: །ང་རྒྱལ་ངན་པའི་སེམས་མི་འབྲང་།
en: They do not succumb to the negative attitude of pride,

source: །གཡོ་སྒྱུ་དག་ཀྱང་སྐྱེད་མི་བྱེད།
en: Nor do they give rise to deceit and guile.

source: །གཡོ་སྐྱེད་པ་ནི་བྱང་ཆུབ་མིན།
en: Giving rise to deceit is not the way to pursue awakening.

source: །མ་ཐོས་ཆོས་ནི་ཐོས་གྱུར་ན། །དེ་ཡི་དོན་ནི་ཚོལ་བྱེད་པས།
en: “When they hear a Dharma teaching they have not heard before, They pursue what it means.

source: །སྔོན་ཆད་ཐོས་པར་མ་གྱུར་ཀྱང་།
en: Even if they have never previously heard it,

source: །རྩེ་གཅིག་ཏུ་ནི་སེམས་པར་བྱེད།
en: They reflect on it one-pointedly.

source: །གང་ཟག་དེས་ནི་ཆོས་ཐོས་ཚེ།
en: “When those persons hear the Dharma,

source: །ཡང་དག་ཆོས་ནི་ཐོས་འགྱུར་ཞིང་།
en: They hear the authentic Dharma.

source: །རྟག་པར་སངས་རྒྱས་མང་མཐོང་བས།
en: They will always encounter many buddhas,

source: །བྱང་ཆུབ་ལས་ནི་ལྡོག་མི་འགྱུར།
en: And never regress from awakening.

source: །ཚུལ་བཞིན་ཞུ་བ་ཞུ་བྱེད་པས།
en: They will ask them proper questions,

source: །ཉན་ཐོས་དག་གིས་ཐོས་ན་ཡང་།
en: And all those who hear such questions, even the hearers,

source: །ཐམས་ཅད་རབ་ཏུ་དགའ་བར་འགྱུར།
en: Will become utterly pleased.

source: །འདི་ནི་ངོ་མཚར་རྨད་ལྡན་པས།
en: “Since this is amazing and marvelous,

source: །འདི་འདྲའི་ཞུ་བ་ཞུ་བར་བྱེད།
en: One should ask such questions!

source: །བདག་ཅག་བསམ་པའང་ཡོད་མིན་ན།
en: Unless the thought to ask occurs,

source: །དངོས་པོ་འདི་ཐོས་ཅི་སྨོས་ཟེར།
en: How will we ever hear about these matters?

source: །ཉན་ཐོས་ངོ་མཚར་བརྗོད་པས་ན།
en: “Since the hearers express their amazement,

source: །ལྷ་ཀླུ་ཐམས་ཅད་དགའ་འགྱུར་ཞིང་།
en: All the gods and nāgas will be pleased,

source: །སངས་རྒྱས་བསྔགས་པ་བརྗོད་འགྱུར་བ།
en: And the buddhas will proclaim their praises.

source: །འདི་ནི་མང་ཐོས་འབྲས་བུ་ཡིན།
en: These are the results of erudition.

source: །ཞུ་བ་གང་ཡོད་ཞུས་པའི་ཚེ། །སངས་རྒྱས་དེ་བཞིན་ལན་འདེབས་པས། །འཁོར་འདུས་མང་པོ་ཚད་མེད་པ། །ཐམས་ཅད་ཕན་པ་ཆེ་ཐོབ་འགྱུར།
en: “The buddhas will answer All the questions presented to them, And this will bring immense benefits To all the countless assemblies.

source: །བྱང་ཆུབ་སེམས་དཔས་ལན་འདེབས་པ། །མང་ཐོས་འདི་ནི་ཐོས་གྱུར་ན།
en: “Upon hearing the erudite answers Given to the bodhisattvas,

source: །འཁོར་མང་ཚད་མེད་ཐམས་ཅད་ཀྱིས།
en: All the countless assemblies will attain

source: །བླ་མེད་ཆོས་མིག་ཐོབ་པར་འགྱུར།
en: The unsurpassed Dharma eye.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་རྒྱུ་དང་རྐྱེན་དེས་ན་བྱང་ཆུབ་སེམས་དཔས་སྔོན་མ་ཐོས་པའི་ཆོས་ཐོས་པར་གྱུར་པ་ན་མངོན་པར་ཡིད་ཆེས་པས་དང་དུ་ལེན་ཅིང་འགལ་བ་མེད་པའི་སེམས་ཀྱིས་ཚུལ་བཞིན་དུ་བསམས་ནས་འདི་ནི་མ་ཡིན་ནོ།
en: “Pūrṇa,” continued the Blessed One, “for those reasons, when bodhisattvas hear a Dharma teaching they have not heard before, they eagerly accept it out of sincere trust, and contemplate it genuinely without contradicting it.

source: །ཞེས་སྨྲ་བར་མི་བྱེད་ན། དེས་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ཀྱི་དོན་བྱེད་པར་འགྱུར་བར་རིག་པར་བྱའོ།
en: They never say, ‘This is not the Dharma.’ You should know that this attitude will benefit countless sentient beings.

source: །གང་པོ་སྔོན་འདས་པའི་བསྐལ་པ་གྲངས་མེད། ཚད་མེད། དཔག་ཏུ་མེད། བསམ་གྱིས་མི་ཁྱབ་པའི་ཡང་ཆེས་བསམ་གྱིས་མི་ཁྱབ་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: “Pūrṇa, in the past, countless eons ago—so long ago that the length of time cannot be measured, fathomed, or conceived—a thus-gone one, a worthy one, a perfect buddha appeared in the world. He was endowed with perfect knowledge and conduct.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བ། ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: He was a bliss-gone one, a knower of the world, a tamer of beings, an unsurpassed guide, a teacher of both gods and men.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: This blessed buddha was named King of All Qualities’ Light Rays.

source: གང་པོ་བཅོམ་ལྡན་འདས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེའི་སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་ཐུབ་པར་གྱུར་ཏོ།
en: Pūrṇa, the blessed one King of All Qualities’ Light Rays lived for eight hundred million years.

source: །བཅོམ་ལྡན་འདས་དེའི་འཁོར་འདུས་པ་རེ་རེ་ལ་ཡང་ཉན་ཐོས་ཀྱི་དགེ་འདུན་གང་གཱའི་ཀླུང་བརྗོད་ཀྱིས་མི་ལང་བའི་བྱེ་མ་སྙེད་ཆོས་རྣམས་ལ་ལེན་པ་མེད་ཅིང་ཟག་པ་ཟད་ནས་སེམས་རྣམ་པར་གྲོལ་བའི་དགྲ་བཅོམ་པ་གཉི་གའི་ཆ་ལས་རྣམ་པར་གྲོལ་བ་ཤ་སྟག་བྱུང་སྟེ།
en: In each assembly of this blessed one, the saṅgha of hearers consisted of an indescribable number of worthy ones, as numerous as the grains of sand in the Ganges river. Free of any appropriation regarding phenomena and having exhausted their defilements, their minds were completely liberated, and they were all free from the twofold notion of individuality.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱི་གྲངས་ཀྱང་དེ་བཞིན་ནོ།
en: The bodhisattvas were similar in number to them.

source: །གང་པོ་བཅོམ་ལྡན་འདས་དེ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་དམ་པའི་ཆོས་ནི་ལོ་དྲུག་ཁྲིར་གནས་པར་གྱུར་ཏོ།
en: Pūrṇa, after the blessed one passed into nirvāṇa, his sublime Dharma remained for sixty thousand years.

source: །དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སུ་ཉེ་བའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་བརྒྱ་ཕྲག་མང་པོ་ཐམས་ཅད་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་དམ་པའི་ཆོས་བསྲུང་བའི་ཕྱིར་འཛམ་བུའི་གླིང་བྱེ་བ་བརྒྱ་ཕྲག་མང་པོ་ཀུན་དུ་ཁྱབ་པར་གྱུར་པས་འཛམ་བུའི་གླིང་རེ་རེ་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རེ་རེ་གནས་པར་གྱུར་ཏོ།
en: “When he was about to pass into nirvāṇa, all the many billions of bodhisattvas used their miraculous powers to pervade many billions of worlds, in order to protect the sacred Dharma. In this way, a bodhisattva remained in each world.

source: །གང་པོ་བཅོམ་ལྡན་འདས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་དེའི་ཉན་ཐོས་རྣམས་ཁད་ཀྱིས་ལེ་ལོ་དང་། སྙོམ་ལས་ཅན་དུ་གྱུར་ནས་འདི་ལྟ་བུའི་མདོ་སྡེ་ཟབ་མོ་དག་ཁ་ཏོན་དུ་འདོན་ཅིང་ཡོངས་སུ་འཛིན་པ་མེད་པར་གྱུར་པས་ཆོས་རྣམས་སྟོང་པ་ཉིད་དང་ལྡན་པའི་མདོ་སྡེ་དང་། ཚུལ་ཁྲིམས་རྣམ་པར་དག་ཅིང་སྦྱངས་པའི་ཡོན་ཏན་དང་ལྡན་པའི་མདོ་སྡེ་ཐམས་ཅད་ཀྱང་མཐར་གྱིས་ནུབ་པར་གྱུར་ཏེ། དེ་དག་གིས་བཀླག་པ་དང་། ཁ་ཏོན་དུ་འདོན་པ་དང་།
en: Pūrṇa, after the blessed one King of All Qualities’ Light Rays passed into nirvāṇa, his hearers slowly became lazy and indolent. They did not recite or remember his profound discourses anymore. As a consequence, all his profound discourses related to the emptiness of phenomena, as well as all the discourses related to pure discipline and the ascetic practices, gradually vanished.

source: རྣམ་པར་བཤད་པ་མ་བྱས་པའི་ཕྱིར་དེའི་བསྟན་པ་ལས་ཆོས་ཀྱི་སྡེ་སྣོད་ཤིན་དུ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་ལ།
en: These Dharma teachings consisted of eighty-four thousand vast and detailed sections.

source: ཆོས་ཀྱི་སྡེ་སྣོད་རེ་རེ་ལ་ཡང་མདོ་སྡེ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ཡོད་དེ་མདོའི་སྡེ་རེ་རེ་ལ་ཡང་ཆེད་དུ་བརྗོད་པའི་སྡེ་སུམ་ཁྲི་དྲུག་བརྒྱ་ཡོད་དེ།
en: Each of the sections included sixty-eight trillion discourses.

source: ཆེད་དུ་བརྗོད་པའི་སྡེ་རེ་རེ་ལ་ཡང་ཚིགས་སུ་བཅད་པ་བྱེ་བ་ཕྲག་དྲུག་ཁྲི་བདུན་བརྒྱ་ཡོད་དེ།
en: Each discourse contained thirty thousand six hundred aphorisms, and each aphorism was composed of six hundred seven billion verses.

source: གང་པོ་དེའི་ཚེ་དེའི་དུས་ཐ་མ་ལ་དམ་པའི་ཆོས་ནུབ་ཏུ་ཉེ་བ་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྡེ་སྣོད་མང་པོ་དེ་དག་ལས་མདོའི་སྡེ་དང་། ཆེད་དུ་བརྗོད་པའི་སྡེ་འབའ་ཞིག་ལུས་པར་གྱུར་ཏོ།
en: Pūrṇa, since they did not read, recite, or expound those teachings, at the time when the sublime Dharma was about to vanish during the final age, only the discourses and the aphorisms remained from among the many sections of this buddha’s teachings.

source: །དེའི་ཚེ་ཆོས་སྨྲ་བའི་དགེ་སློང་མཐུ་བོ་ཆེ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ། འཛམ་བུའི་གླིང་འདིར་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་གྱི་མཐུས་དམ་པའི་ཆོས་བསྲུང་བའི་ཕྱིར་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པ་མང་དུ་ཐོས་ཤིང་རྒྱ་ཆེ་བ།
en: “At that time, there was a Dharma-preaching monk called Mahāsthāmaprāpta. The Dharma preacher Mahāsthāmaprāpta had developed great powers and his erudition was vast.

source: ཆོས་ལེགས་པར་སྟོན་པ། ཚིག་རྒྱན་དང་ལྡན་པ།
en: He was an excellent Dharma teacher, he was eloquent, and he had clearly realized the meaning of the Dharma.

source: དོན་གྱི་ཚུལ་གསལ་བར་རྟོགས་པ་དེས་རྟག་པར་སྔོན་མ་ཐོས་པའི་ཆོས་བསྒྲགས་པ་ལ་མོས་པར་གྱུར་ཏོ།
en: Through the miraculous power of the Thus-Gone One, he always devoted himself to spreading previously unheard Dharma teachings in order to protect the sublime Dharma within the world.

source: །དེས་ཆོས་བསྒྲགས་པར་གྱུར་པ་ན་སྐྱེ་བོ་མང་པོ་ཕལ་ཆེར་སྐུར་པ་འདེབས་ཤིང་འགལ་བར་བྱས་པར་གྱུར་པས་ཆོས་སྨྲ་བའི་དགེ་སློང་མཐུ་ཆེན་ཐོབ་པ་དེ་འདི་སྙམ་དུ་འདི་ལྟར་སྐྱེ་བོ་མང་པོ་འདི་དག་སྔོན་མ་ཐོས་པའི་ཆོས་ཐོས་པར་གྱུར་ཀྱང་མངོན་པར་ཡིད་མི་ཆེས་པས་མཉན་པ་དང་། ལེན་པར་མོས་པ་ཡང་མེད་ལ།
en: While he was spreading the Dharma, most beings would deprecate and oppose him. The Dharma-preaching monk Mahāsthāmaprāpta therefore thought, ‘When such beings hear these Dharma teachings that they have never heard before, they do not believe in them, so they also show no interest in listening to them or adopting them.

source: གལ་ཏེ་ཐོས་པར་གྱུར་ན་ཡང་ཁོང་དུ་མི་ཆུད་པས་རྗེས་སུ་འབྲང་བར་མི་བྱེད་ཅིང་འགལ་བར་བྱས་ནས་སྐྱོན་འབྱིན་པར་བྱེད་པས་འདི་སྐད་དུ་འདི་ནི་སངས་རྒྱས་ཀྱི་བཀའ་ཡང་མ་ཡིན་ལ།
en: Even when they hear these teachings, they do not comprehend their meaning, and therefore they do not follow them. Instead, they oppose and deprecate these teachings. Many monks say, “These are not the words of the Buddha;

source: སྟོན་པ་ཆེན་པོའི་བསྟན་པ་ཡང་མ་ཡིན་ནོ།
en: these are not the teachings of the Great Teacher!

source: བདག་ཅག་གིས་སྔོན་ཆད་ནམ་ཡང་སློབ་དཔོན་དང་། མཁན་པོ་ལས་འདི་ལྟ་བུའི་མདོ་སྡེ་མ་ཐོས་ལ།
en: Because we have never heard such discourses from any teacher or preceptor before.

source: གཞན་ཡང་དགེ་སློང་གནས་བརྟན་རྒན་རབས་གང་ཡང་སློབ་དཔོན་དང་། མཁན་པོ་ལས་འདི་ལྟ་བུ་བརྒྱུད་དེ་ཐོས་པར་མི་སྨྲ་བས་སོ་ཞེས་དགེ་སློང་མང་པོ་དེ་སྐད་ཀྱང་ཟེར་ལ། མདོའི་སྡེ་དང་། ཆེད་དུ་བརྗོད་པའི་སྡེ་ཙམ་ལས་མ་ལུས་པས་དེང་བདག་ཅིའི་ཕྱིར་གཅིག་པུ་གནས་དབེན་པར་མི་འགྲོ་སྙམ་མོ།
en: Furthermore, no elder monks from older generations have ever said that they received such a transmission from any teacher or preceptor.” So since no other teachings now remain besides those of the discourses and those of the aphorisms, should I perhaps leave for a solitary place and remain there alone?’

source: །གང་པོ་ཆོས་སྨྲ་བའི་དགེ་སློང་མཐུ་ཆེན་ཐོབ་པ་དེ། དེ་སྙམ་དུ་བསམས་ནས་གཅིག་པུ་རི་ཕུག་དབེན་པར་གནས་པར་གྱུར་ཏོ།
en: “Pūrṇa, after having reflected in that way, the Dharma-preaching monk Mahāsthāmaprāpta left for a mountain cave, where he remained in solitude.

source: །དེའི་ཚེ་འཛམ་བུའི་གླིང་ན་བསྐལ་པ་ཆགས་ཚུན་ཆད་གྲོང་ཁྱེར་ཆེན་པོ་ཆུར་དཔག་ཚད་བཅུ་གཉིས་ཡོད་པ། ཞེང་དུ་དཔག་ཚད་བདུན་ཡོད་ཅིང་རབ་ཏུ་མཛེས་པར་བྱས་པ།
en: At that time, within the world, during the formative eon, there were sixty-eight thousand great cities that were twelve leagues long and seven leagues wide.

source: ལམ་སྲང་རྣམས་ཐད་ཀར་འབབ་པ། སྐྱེ་བོ་མང་པོས་གང་བ། ལོ་ལེགས་ཤིང་བདེ་བར་གྱུར་པ་དྲུག་ཁྲི་བརྒྱད་སྟོང་ཡོད་པར་གྱུར་ཏོ།
en: They were built beautifully, their roads were straight, they were filled with many beings, their harvests were good, and everyone was happy.

source: །དེའི་འོག་ཏུ་ཕྱིས་ཡང་གྲོང་ཁྱེར་ཆུང་ངུ་ཁ་ཅིག་ནི་དཔག་ཚད་བདུན་ཡོད་པ། ཁ་ཅིག་ནི་དཔག་ཚད་དྲུག་དང་། ལྔ་དང་། བཞི་དང་། གསུམ་དང་། གཉིས་ཡོད་པ་ནང་གི་ཆུང་བའི་ཚད་ཀྱང་དཔག་ཚད་གཅིག་ཡོད་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་བྱས་པར་གྱུར་ཏེ།
en: Later on, eight hundred forty million smaller cities were built. Some measured seven leagues and others were six, five, four, three, or two leagues. The smallest of them measured a single league.

source: གང་པོ་དེའི་ཚེ་འཛམ་བུའི་གླིང་ན་གྲོང་ཁྱེར་ཆེན་པོ་རབ་ཏུ་དབེན་པ་ཞེས་བྱ་བ་ན་ཁྱིམ་བདག་ཤ་ནི་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེའི་བུ་ནི་མ་ཧཱ་ཤུ་མ་ཏ་ཞེས་བྱ་སྟེ།
en: Pūrṇa, at that time, within the world, in a great city called Total Isolation, there was a householder named Śani who had a son named Mahāśumata.

source: ཁྱིམ་བདག་དེའི་བུ་དེ་དབེན་པ་ན་གནས་པ་ལས་ལྷ་ཞིག་འོངས་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: While the son of that householder was residing in a solitary place, he received the visit of a god who spoke these verses to him:

source: ཁྱོད་ཀྱིས་ནན་ཏན་ཆོས་དག་ལ།
en: “ ‘Search for Dharma teachings persistently

source: །བཙལ་ནས་ཚུལ་བཞིན་སོམས་ཤིག་དང་། །
en: And reflect on them genuinely.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱལ།
en: The thus-gone one King of All Qualities

source: །ཁྱོད་འཚང་རྒྱ་བར་ལུང་སྟོན་ཏོ།
en: Prophesied that you will become awakened.’

source: །གང་པོ་ལྷ་དེས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་ནས་མི་སྣང་བར་གྱུར་ཏོ།
en: “Pūrṇa, after having spoken those verses, the god disappeared.

source: །དེ་ནས་ཁྱིམ་བདག་གི་བུ་དེ་ཕའི་དྲུང་དུ་སོང་ནས་རྐང་པ་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། འདི་སྐད་དུ་བདག་ནི་རབ་ཏུ་བྱུང་ནས་བཅོམ་ལྡན་འདས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོའི་བསྟན་པ་ལ་ཚངས་པར་སྤྱོད་པར་འདོད་དོ་ཞེས་སྨྲས་པ་དང་། དེ་ནས་ཁྱིམ་བདག་ཤ་ནིས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Then the householder’s son approached his father, paid homage to him by touching his feet with his head, and said, ‘I want to go forth as a monk and live the holy life under the teachings of the blessed one King of All Qualities’ Light Rays.’ At that moment Śani, the householder, spoke these verses:

source: ང་ཡི་ཁྱིམ་ན་རིན་ཆེན་མང་།
en: “ ‘In my home there are many precious gems,

source: །གསེར་དངུལ་དག་ནི་ཚད་ཀྱང་མེད།
en: And an immeasurable amount of silver and gold.

source: །འཛམ་བུའི་གླིང་ན་མེད་པ་ཀུན། །ང་ཡི་ཁྱིམ་ན་ལྡན་པར་ཡོད།
en: You will find in my home All the things that cannot be found within the world.

source: །ངས་ནི་རིན་ཆེན་བཙལ་བ་ཡང་། །བུ་འདོད་སྤྱོད་ཕྱིར་བཙལ་བཙལ་ན།
en: “ ‘Son, I have accumulated precious gems To be able to fulfill all your desires.

source: །ཅི་ཕྱིར་རབ་ཏུ་འབྱུང་བྱེད་ཅིང་།
en: Why would you go forth as a monk

source: །འཇིག་རྟེན་སྨོད་ལ་དགའ་བར་བྱེད།
en: And take pleasure in deprecating the world?’

source: །དེ་ནས་ཁྱིམ་བདག་གི་བུ་དེས་ཚིགས་སུ་བཅད་དེ་ཕ་ལ་སྨྲས་པ།
en: “The son of the householder answered his father with these verses:

source: བདག་ནི་རྟག་ཏུ་ཆོས་ཚོལ་མོས།
en: “ ‘I only aspire to pursue the Dharma

source: །བཙལ་ནས་ཡང་དག་ཚུལ་བཞིན་སེམས།
en: And contemplate it genuinely.

source: །ལོངས་སྤྱོད་མྱོང་བར་མི་དགའ་བས།
en: I do not experience pleasure while indulging in wealth.

source: །འཇིག་རྟེན་འདྲེན་པ་བྱེད་པར་དགའ།
en: Instead, I wish to become a guide for the world.

source: །ཁྱིམ་གྱི་རིན་ཆེན་མི་དགོས་པས།
en: “ ‘I do not need this home’s precious gems.

source: །བདག་ནི་འདོད་པ་ཉུང་ལ་མོས།
en: I aspire to have few desires.

source: །ཆོས་ཀྱི་གཏེར་ནི་དབྱུང་བའི་ཕྱིར། །རབ་ཏུ་འབྱུང་བར་མོས་པ་ཡིན།
en: I aspire to go forth as a monk, To discover the treasure of the Dharma.

source: །སངས་རྒྱས་འབྱུང་བ་རབ་ཏུ་དཀོན།
en: “ ‘It is extremely rare for a buddha to appear.

source: །ཆོས་བསྟན་པ་ཡང་རབ་ཏུ་དཀོན།
en: It is extremely rare for the Dharma to be taught.

source: །དེང་བདག་སངས་རྒྱས་བསྟན་ཕྲད་ན།
en: Now that I have encountered the teachings of the Buddha,

source: །ཅིའི་ཕྱིར་ན་གཏང་བར་བྱ།
en: Why would I abandon them?’

source: །གང་པོ་དེ་ནས་ཁྱིམ་བདག་གི་བུ་དེས་ཕའི་རྐང་པ་ལ་ཕྱག་བྱས་ཏེ་བསྐོར་བ་བྱས་ནས་ཕྱིར་བྱུང་སྟེ་འགྲོ་བའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: “Pūrṇa, the householder’s son then prostrated to the feet of his father, circumambulated him, and left the house. In leaving he spoke these verses to him:

source: །ཕ་ནི་བྱེ་བ་འབུམ་ཡོད་ཅིང་།
en: “ ‘Even if I had one trillion fathers

source: །མ་ནི་བྱེ་བ་བརྒྱ་ཡོད་ཀྱང་། །
en: And one billion mothers,

source: དེང་བདག་རབ་ཏུ་འབྱུང་བའི་སེམས། །གང་གིས་ཀྱང་ནི་བཟློག་མི་ནུས།
en: None of them could prevent me From going forth as a monk.

source: །དེང་བདག་ལུས་སྲོག་ཕ་མ་དང་། །གཉེན་འདབ་ཀུན་ནི་རབ་སྤངས་ནས།
en: “ ‘Now I will completely relinquish My body, my life force, my parents, and my relatives.

source: །སངས་རྒྱས་ཆོས་ནི་མི་སྤོང་བར།
en: Without ever abandoning the Dharma of the Buddha,

source: །རབ་བྱུང་སྤྱོད་པ་གཉེར་བར་བྱེད།
en: I will pursue the conduct of one who goes forth.’

source: །གང་པོ་དེའི་ཚེ་ཁྱིམ་བདག་གི་བུ་དེས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་ནས་རབ་ཏུ་བྱུང་བར་གྱུར་ཏེ།
en: “Pūrṇa, after the householder’s son had uttered those verses, he went forth as a monk.

source: ཆོས་སྨྲ་བའི་དགེ་སློང་མཐུ་ཆེན་ཐོབ་པ་ག་ལ་བ་དེར་སོང་ནས་ཆོས་མཉན་པ་གཉེར་བར་གྱུར་པ་དང་། དེ་ནས་དེའི་ཚེ་ཆོས་སྨྲ་བ་མཐུ་ཆེན་པོ་ཐོབ་པས་ཀྱང་དེ་ལ་སྔོན་མ་ཐོས་པའི་མདོ་སྡེ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: He then went to the place where the Dharma-preaching monk Mahāsthāmaprāpta was residing and he applied himself to studying the Dharma with him. During that time, the Dharma preacher Mahāsthāmaprāpta taught him genuinely and in great detail discourses that he had never heard before.

source: །དེ་ནས་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་སྔོན་མ་ཐོས་པའི་མདོ་སྡེ་ཐོས་པར་གྱུར་ནས་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་གིས་འདི་ལྟ་བུའི་མདོ་སྡེ་སྔོན་ཆད་མ་ཐོས་ན་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་སུས་ནི་ཀློག་པར་བྱེད།
en: When he heard those discourses, the monk Mahāśumata asked the Dharma preacher Mahāsthāmaprāpta, ‘I have never heard such discourses before. Who is reading them?

source: །སུས་ནི་འདུན་པར་བྱེད།
en: Who is interested in them?

source: སུས་ནི་ཡང་དག་པར་བླངས་ནས་འཛིན་པར་བྱེད།
en: Who is adopting them and memorizing them?

source: གནས་གང་དུ་ནི་ཐོས་པར་འགྱུར།
en: In which places are they heard?’

source: །མཐུ་ཆེན་ཐོབ་པས་སྨྲས་པ། བདག་གིས་སྔོན་གྱི་ཚེ་རབས་རྗེས་སུ་དྲན་པའི་དགེ་བའི་རྩ་བའི་རྒྱུ་དང་རྐྱེན་གྱིས་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོའི་བྱིན་གྱི་རླབས་ཀྱི་མཐུའི་དབང་གིས་འདི་ལྟ་བུའི་མདོ་སྡེ་ཟབ་མོ་རང་གི་ངང་གིས་སེམས་ལ་གནས་པར་གྱུར་ཏོ།
en: “The monk Mahāsthāmaprāpta replied, ‘Due to the roots of virtue created by recollecting my previous lives, and through the power of the blessings of the thus-gone one King of All Qualities’ Light Rays, these profound discourses have naturally remained within my mind.’

source: །གང་པོ་དེའི་ཚེ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་དེ་སྐད་ཅེས་སྨྲས་པ་ཐོས་ནས་ལྷག་པའི་བསམ་པ་བསྐྱེད་དེ་རྗེས་སུ་བསམ་པས་ཤེས་རབ་ཀྱི་མཐུ་སྐྱེས་པས་ཤེས་རབ་དང་། ཐབས་མཁས་པ་ཆེན་པོའི་སྟོབས་ཀྱིས་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པ་ལ་དྲི་བ་དྲིས་པ་དང་། མཐུ་ཆེན་ཐོབ་པས་ཀྱང་དོན་གྱི་རྗེས་སུ་ལན་ཡང་དག་པར་བཏབ་ནས་འདི་སྐད་དུ་སྔོན་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོ་ལ་དགེ་སློང་ཞིག་གིས་དངོས་པོ་འདི་དེང་ཁྱོད་ཀྱིས་ཇི་སྐད་དྲིས་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཞུས་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་དེ་བཞིན་དུ་ཡང་དག་པར་ལན་བཏབ་པ་དགེ་སློང་དེས་ཐོས་པར་གྱུར་ནས་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ་ཞེས་སྨྲས་སོ།
en: “Pūrṇa, upon hearing those words, the monk Mahāśumata generated an extraordinary resolve, and by keeping this resolve in mind, the strength of insight arose. Because of this, through the power of his great insight and skillful means, he asked a question of the Dharma preacher Mahāsthāmaprāpta, who answered his question, and then said to him, ‘In the past, a monk asked the thus-gone one King of All Qualities’ Light Rays about the same matter that you have now asked me about, and when that monk heard the perfect answer of the Thus-Gone One, he was overjoyed.’

source: །གང་པོ་དེའི་ཚེ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པ་ལ་ཡང་འདི་སྐད་དུ་དྲིས་པ་དང་། མཐུ་ཆེན་ཐོབ་པས་ཀྱང་འདི་སྐད་དུ་སྔོན་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོ་ལ་དགེ་སློང་ཞིག་གིས་དངོས་པོ་འདི་དེང་ཁྱོད་ཀྱིས་ཇི་སྐད་དྲིས་པ་དེ་བཞིན་དུ་ཞུས་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་དེ་བཞིན་དུ་ལན་ཡང་དག་པར་བཏབ་པ་དགེ་སློང་དེས་ཐོས་ནས་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ་ཞེས་སྨྲས་སོ།
en: “Pūrṇa, the monk Mahāśumata again asked a question of the Dharma preacher Mahāsthāmaprāpta, who again told him, ‘In the past, a monk asked the thus-gone one King of All Qualities’ Light Rays about the same matter that you now ask me about, and when that monk heard the perfect answer of the Thus-Gone One, he was overjoyed.’

source: །གང་པོ་དེའི་ཚེ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་སྐྱེས་བུ་དམ་པ་སྔོན་དེ་བཞིན་གཤེགས་པ་ལས་ཞུས་པ་དང་། ལན་འདེབས་པའི་དངོས་པོ་འདི་ལྟ་བུ་ལན་དུ་ཞིག་ཐོས་པར་གྱུར།
en: “Pūrṇa, the monk Mahāśumata then asked the Dharma preacher Mahāsthāmaprāpta, ‘O sublime being, how many times have you heard questions and answers on such matters from the Thus-Gone One?’

source: མཐུ་ཆེན་ཐོབ་པས་སྨྲས་པ། དངོས་པོ་འདི་ནི་ཤིན་དུ་ཡིད་ཆེས་པར་དཀའ་བས་དངོས་པོ་འདི་མ་དྲི་བར་ཞོག་ཤིག །གཞན་ཡང་གང་ལུས་ཀྱི་ཆོས་ཁྱད་པར་དུ་འཕགས་པ་མངོན་སུམ་དུ་མ་བྱས་པ་དག་གིས་ཀྱང་ཤིན་དུ་ཡིད་ཆེས་པར་དཀའོ།
en: “Mahāsthāmaprāpta replied, ‘That is something it would be extremely difficult to believe, so do not ask me about it! Furthermore, it is extremely difficult to believe for those who have not actualized extraordinary physical qualities.’

source: །དེ་བཞིན་དུ་ལན་གཉིས་ལན་གསུམ་གྱི་བར་དུ་མ་ཧཱ་ཤུ་མ་ཏས་ཀྱེ་སྐྱེས་བུ་དམ་པ་སྔོན་དེ་བཞིན་གཤེགས་པ་ལས་ཞུས་པ་དང་། ལན་འདེབས་པའི་དངོས་པོ་འདི་ལྟ་བུ་ལན་དུ་ཞིག་ཐོས་པར་གྱུར།
en: “But Mahāśumata repeated the same question a second and a third time: ‘O sublime being, how many times have you heard questions and answers on such matters from the Thus-Gone One?

source: མཐུ་ཆེན་ཐོབ་པས་སྨྲས་པ།
en: Mahāsthāmaprāpta simply answered, ‘Do not ask me about that!

source: དངོས་པོ་འདི་མ་དྲི་བར་ཞོག་ཤིག །གལ་ཏེ་ཁོང་དུ་མ་ཆུད་པར་གྱུར་ན་དེང་ཁྱོད་ལ་དཔེས་ཉེ་བར་མཚོན་པར་བྱ་སྟེ། བློ་དང་ལྡན་པ་དག་ནི་དཔེས་ཉེ་བར་མཚོན་ན་རབ་ཏུ་རྟོགས་པར་འགྱུར་རོ།
en: “ ‘If you have not understood, I will now illustrate this for you through an analogy, for when something is illustrated with an analogy, intelligent people understand.

source: །དགེ་སློང་བདག་གིས་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོ་ལས་སེམས་ཅན་གྱི་རང་བཞིན་ཐོས་པ་ནི་ས་ཆེན་པོའི་རྣམ་པ་བས་ཆེས་མང་ངོ་།
en: Monk, the dispositions of sentient beings whom I heard about from the thus-gone one King of All Qualities’ Light Rays are far more numerous than the atoms in the earth.

source: །དགེ་སློང་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་ཡོད་པའི་སེམས་ཅན་གྱི་རྣམ་པ་གཟུགས་ཅན་ནམ། གཟུགས་ཅན་མ་ཡིན་པའམ། འདུ་ཤེས་ཅན་ནམ། འདུ་ཤེས་མེད་པའམ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་མིའི་ལུས་ཐོབ་ནས་ཤེས་རབ་ཀྱི་སྟོབས་དང་ལྡན་པར་གྱུར་ལ།
en: Monk, imagine that all the kinds of sentient beings present throughout the trichiliocosm—those that have a form, those that have no form, those that have perception, those that have no perception, and those that have neither perception nor nonperception—obtained a human body and possessed the power of insight.

source: སེམས་ཅན་དེ་དག་རེ་རེས་ཀྱང་ཡུན་སེ་གོལ་གཏོགས་པ་གཅིག་ལ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་དྲི་བ་སོ་སོ་ནས་མི་འཐུན་པ་དག་དྲིས་པར་གྱུར། དགེ་སློང་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མ་ལུས་པ་ཐམས་ཅད་ན་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་བསྐལ་པ་གཅིག་གམ། བསྐལ་པ་གཅིག་ལས་ལྷག་པའི་བར་དུ་དྲི་བ་མང་པོ་དེ་ལྟ་བུ་དྲིས་པར་གྱུར།
en: Imagine that each of them repeatedly asked—as quickly as a snap of the fingers—as many questions as the grains of sand in the Ganges river, and that all those sentient beings present in the universes of the ten directions asked those many questions for an eon or even longer.

source: གཞན་ཡང་གང་ཟག་གཅིག་གིས་སེ་གོལ་གཏོགས་པ་གཅིག་ལ་གང་ཟག་དེ་སྙེད་ཀྱི་དྲི་བ་ཐ་དད་ཅིང་མི་འཐུན་པ་ཐམས་ཅད་དྲིས་པར་གྱུར། དེ་བཞིན་དུ་གཞན་ཡང་གང་ཟག་གཅིག་གིས་སེམས་ཅན་མ་ལུས་པ་མཐར་ཐུག་པ་སྙེད་ཀྱི་དྲི་བ་སྣ་ཚོགས་བསྐལ་པ་གཅིག་གམ། བསྐལ་པ་གཅིག་ལས་ལྷག་པའི་བར་དུ་དྲིས་པར་གྱུར་ན།
en: Furthermore, imagine that in every moment—as quickly as a snap of the fingers—each single person asked all the other persons’ different questions, and that each person asked all those infinite, various questions of other sentient beings for an eon or even longer.

source: འདི་ཇི་སྙམ་དུ་སེམས། དྲི་བ་དེ་དག་ཅི་མང་བ་ཡིན་སྙམ་འམ།
en: If this were the case, what do you think—how numerous would those questions be?’

source: སྨྲས་པ། དེ་ཤིན་དུ་མང་བས་དཔེར་སླ་བ་ཡང་མ་ཡིན་ནོ།
en: “ ‘There would be so many questions that their number could hardly be illustrated,’ answered Mahāśumata.
